In [ ]:
import pandas as pd
import numpy as np

# Concat

In [ ]:
df11 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds11.csv')
df11

In [ ]:
df12 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds12.csv')
df12

In [ ]:
dfc = pd.concat(objs = (df11,df12), axis=0, join='outer')
dfc

In [ ]:
dfc = pd.concat(objs = (df11,df12), axis=0, join='inner')
dfc

In [ ]:
dfc.loc['Kolkata_FMCG', 'EmpCnt']

In [ ]:
dfc1 = pd.concat(objs = (df11,df12), axis=0, join='inner', keys=['df11', 'df12'])
dfc1

dfc1.loc['Kolkata_FMCG', 'EmpCnt']   #error

In [ ]:
dfc1.loc[('df12',  'Kolkata_FMCG'), 'EmpCnt']

In [ ]:
dfc1

In [ ]:
dfc1.iloc[6]

In [ ]:
dfc1.index

In [ ]:
dfc1

In [ ]:
dfc2 = dfc1.sort_index()
dfc2

In [ ]:
dfc2.loc[('df11',     'Bombay_Sporting') : ('df12',   'Chennai_Chemicals')   ,'HQ']

In [ ]:
dfc2.loc[['df11',      ('df12','Chennai_Chemicals')]]

In [ ]:
dfc2.loc[[('df11',     'Bombay_Sporting'),('df12',   'Chennai_Chemicals') ]]

In [ ]:
dfc2.loc[['df11',      ('df12','Chennai_Chemicals')]]#  check this

In [ ]:
dfc2.loc[['df11','df12']]

In [ ]:
dfc = pd.concat(objs = (df11,df12), axis=1, join='outer')
dfc

In [ ]:
dfc = pd.concat(objs = (df11,df12), axis=1, join='outer', keys=['f1','f2'])
dfc

In [ ]:
dfc.loc['Chennai_Shipping', (('f1', 'EmpCnt'))]

In [ ]:
dfc = pd.concat(objs = (df11,df12), axis=1, join='inner', keys=['f1','f2'])
dfc

In [ ]:
df11.append(df12)

# Stack, Unstack

           2018                       2019 
           q1           q2             q1               q2
           fmcg tech    fmcg tech     fmcg tech         fmcg tech  
Tata
Birla
Wipro
ITC

In [ ]:
np.random.seed(25)
n48 = np.random.randint(10,100, size=(4,8))
n48

In [ ]:
index_labels = ['Tata', 'Birla', 'Wipro', 'ITC']

In [ ]:
columns_labels = pd.MultiIndex.from_product([[2018,2019], ['Q1','Q2'], ['FMCG','Tech']])
print(columns_labels)

In [ ]:
df1 = pd.DataFrame(n48,  index=index_labels, columns=columns_labels)
df1

In [ ]:
df1.index

In [ ]:
df1.columns

In [ ]:
df1.index.levels

In [ ]:
df1.columns.levels

In [ ]:
df1.loc['Tata', (2019, 'Q2', 'FMCG')]

In [ ]:
print(type(df1.columns.levels))

In [ ]:
df1=pd.DataFrame(n48,index=['Tata','Birla','Wipro','Itc'],columns=pd.MultiIndex.from_product([[2018,2019],['Q1','Q2'],['FMCG','Tech']]))

In [ ]:
df1

In [ ]:
df1

In [ ]:
df1.index

In [ ]:
df1.columns

In [ ]:
df1

In [ ]:
dfs1 = df1.stack(level=-1)
dfs1

In [ ]:
dfs1.index

In [ ]:
dfs1.index.levels

In [ ]:
dfs1.columns

In [ ]:
dfs1

In [ ]:
dfu1 = dfs1.unstack(level=0)

In [ ]:
dfu1

# Pivot Table

In [ ]:
df1 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds1.csv')
df1

In [ ]:
dp = pd.pivot_table(df1,  index='Catg', aggfunc='mean')
dp

In [ ]:
dp = pd.pivot_table(df1,  index='Catg', aggfunc=['mean','sum', 'count'])
dp

In [ ]:
dp = pd.pivot_table(df1,  index=['Catg','HQ'], aggfunc=['mean','sum', 'count'])
dp

In [ ]:
dp = pd.pivot_table(df1,  index=['Catg','HQ'], values='Vol', aggfunc=['mean','sum', 'count'])
dp

In [ ]:
dp = pd.pivot_table(df1,  index='Catg', columns='HQ', values='Vol', aggfunc=['mean','sum', 'count'])
dp

In [ ]:
dp = pd.pivot_table(df1,  index='Catg', values='Vol', aggfunc=[np.min, np.max])
dp

In [ ]:
def maxmindiff(c):
    print(c)
    print(type(c))
    return c.max()-c.min()


minmaxdiff = lambda c:c.min()-c.max()

In [ ]:
dp = pd.pivot_table(df1,  index='Catg', values='Vol', aggfunc=[np.min, np.max, maxmindiff])
dp

In [ ]:
dp = pd.pivot_table(df1,  index='Catg', values='Vol', aggfunc=[np.min, np.max, lambda c:c.min()-c.max()])
dp

In [ ]:
dp = pd.pivot_table(df1,  index='Catg', values='Vol', aggfunc=[np.min, np.max, minmaxdiff])
dp

# Map,  Rename, Replace

In [ ]:
df1 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds1.csv')
df1

In [ ]:
md = {'Mum':'WZ', 'Che':'SZ', 'NCR':'NZ', 'Kol':'EZ','Blr':'SZ'}

In [ ]:
df1['Zone'] = df1.HQ.map(md)
df1

<925 : AvSales,  >925 < 950 : GoodSales >950 Excellent Sales

In [ ]:
def salesCategory(sales):
    if sales < 925:
        return 'Av_Sales'
    elif 925 <= sales < 950:
        return 'Gd_Sales'
    else:
        return 'Ex_Sales'

In [ ]:
df1['Saleclass'] = df1.Vol.map(salesCategory)
df1

In [ ]:
salesclass = lambda sales : 0 if sales < 925 else 2 if sales > 950 else 1

In [ ]:
df1['SaleclassNum'] = df1.Vol.map(salesclass)
df1

In [ ]:
col_d = {'Vol': 'Volume', 'Rev':'Revenue'}
row_d = {'Indi_Services': 'Irailways', 'Bangalore_Breweries': 'UB'}

In [ ]:
df2 = df1.rename(index=row_d,  columns=col_d)
df2

In [ ]:
df1['Catg'].replace(to_replace = 'Pub',value='Public',inplace=True )

In [ ]:
rep_d = {'Gov':'government', 'Pvt':'Private'}

In [ ]:
df1['Catg'].replace(rep_d,inplace=True )

In [143]:
df1

,Vol,Rev,Exp,Catg,EmpCnt,HQ,Zone,Saleclass,SaleclassNum
Bombay_Finance,899,917.0,674,Public,1443,Mum,WZ,Av_Sales,0
Bombay_Sporting,925,839.8,615,Private,154,Mum,WZ,Gd_Sales,1
Kolkata_FMCG,900,874.4,676,Public,1379,Kol,EZ,Av_Sales,0
NCR_Leagles,931,863.5,605,Public,1935,NCR,NZ,Gd_Sales,1
Chennai_Shipping,992,821.0,665,Public,1154,Che,SZ,Ex_Sales,2
Bangalore_Systems,931,881.6,650,government,1361,Blr,SZ,Gd_Sales,1
Bangalore_Breweries,966,805.0,895,Private,119,Blr,SZ,Ex_Sales,2
Chennai_Chemicals,966,863.2,608,Public,1656,Che,SZ,Ex_Sales,2
Indi_Services,954,733.0,609,government,13023,NCR,NZ,Ex_Sales,2

In [144]:
df1.where(df1.Vol != 899, 800)

,Vol,Rev,Exp,Catg,EmpCnt,HQ,Zone,Saleclass,SaleclassNum
Bombay_Finance,800,800.0,800,800,800,800,800,800,800
Bombay_Sporting,925,839.8,615,Private,154,Mum,WZ,Gd_Sales,1
Kolkata_FMCG,900,874.4,676,Public,1379,Kol,EZ,Av_Sales,0
NCR_Leagles,931,863.5,605,Public,1935,NCR,NZ,Gd_Sales,1
Chennai_Shipping,992,821.0,665,Public,1154,Che,SZ,Ex_Sales,2
Bangalore_Systems,931,881.6,650,government,1361,Blr,SZ,Gd_Sales,1
Bangalore_Breweries,966,805.0,895,Private,119,Blr,SZ,Ex_Sales,2
Chennai_Chemicals,966,863.2,608,Public,1656,Che,SZ,Ex_Sales,2
Indi_Services,954,733.0,609,government,13023,NCR,NZ,Ex_Sales,2

In [145]:
df1.where(df1.Vol != 899)

,Vol,Rev,Exp,Catg,EmpCnt,HQ,Zone,Saleclass,SaleclassNum
Bombay_Finance,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Bombay_Sporting,925.0,839.8,615.0,Private,154.0,Mum,WZ,Gd_Sales,1.0
Kolkata_FMCG,900.0,874.4,676.0,Public,1379.0,Kol,EZ,Av_Sales,0.0
NCR_Leagles,931.0,863.5,605.0,Public,1935.0,NCR,NZ,Gd_Sales,1.0
Chennai_Shipping,992.0,821.0,665.0,Public,1154.0,Che,SZ,Ex_Sales,2.0
Bangalore_Systems,931.0,881.6,650.0,government,1361.0,Blr,SZ,Gd_Sales,1.0
Bangalore_Breweries,966.0,805.0,895.0,Private,119.0,Blr,SZ,Ex_Sales,2.0
Chennai_Chemicals,966.0,863.2,608.0,Public,1656.0,Che,SZ,Ex_Sales,2.0
Indi_Services,954.0,733.0,609.0,government,13023.0,NCR,NZ,Ex_Sales,2.0

In [146]:
df1 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds1.csv')
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [147]:
df1.Vol.where(df1.Vol != 899, 888)

Bombay_Finance         888
Bombay_Sporting        925
Kolkata_FMCG           900
NCR_Leagles            931
Chennai_Shipping       992
Bangalore_Systems      931
Bangalore_Breweries    966
Chennai_Chemicals      966
Indi_Services          954
Name: Vol, dtype: int64

In [148]:

df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [183]:
import numpy as np

data = [
    ['Mon','Football'],
    ['Tues','Cricket'],
    ['Wed','Football'],
    ['Thurs','Hockey'],
    ['Fri','Cricket']    
]

col = ['Days','Tournament']

df2 = pd.DataFrame(data, columns=col)
print(df2)

x = np.where(df2['Tournament'] == 'Football')
print(x)
df2.loc[x[0], 'Tournament'] = 'ABCD'
df2

    Days Tournament
0    Mon   Football
1   Tues    Cricket
2    Wed   Football
3  Thurs     Hockey
4    Fri    Cricket
(array([0, 2], dtype=int64),)

    Days Tournament
0    Mon       ABCD
1   Tues    Cricket
2    Wed       ABCD
3  Thurs     Hockey
4    Fri    Cricket

In [186]:
a= ['Emma', 'Mia', 'Sophia', 'James', 'John']
m= [56, 78, 78, 67, 88]
e= [89, 89, 76, 78, 87]
s= [89, 87, 78, 89, 78]
col= ['Name','Maths', 'English']
d= pd.DataFrame(list(zip(a, m, e)), columns= col)
d

     Name  Maths  English
0    Emma     56       89
1     Mia     78       89
2  Sophia     78       76
3   James     67       78
4    John     88       87

In [187]:
d['Science'] = pd.Series(s)

In [188]:
d

     Name  Maths  English  Science
0    Emma     56       89       89
1     Mia     78       89       87
2  Sophia     78       76       78
3   James     67       78       89
4    John     88       87       78